org/sigma.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-01-31 Fri 10:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>TODOs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Cole Turner" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">TODOs
<br />
<span class="subtitle"><a href="it.html">IT</a> &#x2013; <a href="cascade.html">CASCADE</a> &#x2013; <a href="controller.html">CONTROLLER</a> &#x2013; <a href="filemaker.html">FILEMAKER</a> &#x2013; <a href="misc.html">MISC</a></span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1b1c537"><span class="todo TODO">TODO</span> <span class="priority">[C]</span> Setup Microsoft Teams</a></li>
<li><a href="#org11fa5f8"><span class="todo TODO">TODO</span> <span class="priority">[C]</span> UPS automatic graceful shut down</a></li>
<li><a href="#orgf562edd"><span class="todo TODO">TODO</span> <span class="priority">[C]</span> Migrate FileMaker Server</a></li>
<li><a href="#org16166df"><span class="todo TODO">TODO</span> <span class="priority">[C]</span> Migrate all vsphere-01 VMs</a></li>
<li><a href="#org274a9a3"><span class="todo TODO">TODO</span> <span class="priority">[C]</span> Configure phone(s)</a></li>
<li><a href="#orgf7db739"><span class="todo TODO">TODO</span> <span class="priority">[B]</span> Configure NUMA</a></li>
<li><a href="#org5455f9f"><span class="todo TODO">TODO</span> <span class="priority">[E]</span> iDRAC</a></li>
<li><a href="#org346389e"><span class="todo TODO">TODO</span> <span class="priority">[F]</span> NIST Compliance</a></li>
<li><a href="#org0e0172b"><span class="todo TODO">TODO</span> <span class="priority">[F]</span> Domain Controller setup/migration</a></li>
<li><a href="#org6e17f44"><span class="todo TODO">TODO</span> <span class="priority">[F]</span> Figure out AD certificates issue</a></li>
</ul>
</div>
</div>
<hr />
<div id="outline-container-org1b1c537" class="outline-2">
<h2 id="org1b1c537"><span class="todo TODO">TODO</span> <span class="priority">[C]</span> Setup Microsoft Teams</h2>
</div>

<div id="outline-container-org11fa5f8" class="outline-2">
<h2 id="org11fa5f8"><span class="todo TODO">TODO</span> <span class="priority">[C]</span> UPS automatic graceful shut down</h2>
<div class="outline-text-2" id="text-org11fa5f8">
<p>
Waiting for the new server to get in to do this. For now, the UPS client is running on the Filemaker machine and is sending status notifications to my email.<br />
</p>
<ul class="org-ul">
<li>Periodic extra drive backup.<br /></li>
</ul>
<ul class="org-ul">
<li>iDRAC?\<br /></li>
<li><a href="http://aka.ms/WindowsAdminCenter">Windows Admin Center</a>?<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgf562edd" class="outline-2">
<h2 id="orgf562edd"><span class="todo TODO">TODO</span> <span class="priority">[C]</span> Migrate FileMaker Server</h2>
</div>
<div id="outline-container-org16166df" class="outline-2">
<h2 id="org16166df"><span class="todo TODO">TODO</span> <span class="priority">[C]</span> Migrate all vsphere-01 VMs</h2>
</div>
<div id="outline-container-org274a9a3" class="outline-2">
<h2 id="org274a9a3"><span class="todo TODO">TODO</span> <span class="priority">[C]</span> Configure phone(s)</h2>
<div class="outline-text-2" id="text-org274a9a3">
<p>
Tried to configure some old Grandstream phones but I couldn't get them to work. Looked on 3CX and the provisioning seemed to be the same as the other phones. On the phone's display it kept saying that it wasn't configured. Seems like we need to just order some new phones that are the same kind as the others.<br />
</p>

<p>
Erik's phone is the model GXP2170<br />
<a href="https://www.amazon.com/Grandstream-GS-GXP2170-VoIP-Phone-Device/dp/B019X06IFS/ref=sr_1_1?keywords=gpx+2170&amp;qid=1578338057&amp;sr=8-1">amazon link</a>* List for Sigma IT contractor<br />
</p>
</div>
</div>
<div id="outline-container-orgf7db739" class="outline-2">
<h2 id="orgf7db739"><span class="todo TODO">TODO</span> <span class="priority">[B]</span> Configure NUMA</h2>
<div class="outline-text-2" id="text-orgf7db739">
<ul class="org-ul">
<li>AMD EPYC 7302<br /></li>
<li>2 sockets<br /></li>
<li>64 Logical processors<br /></li>
<li>16 cores per socket<br /></li>
<li>Hyperthreading enabled<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org5455f9f" class="outline-2">
<h2 id="org5455f9f"><span class="todo TODO">TODO</span> <span class="priority">[E]</span> iDRAC</h2>
</div>
<div id="outline-container-org346389e" class="outline-2">
<h2 id="org346389e"><span class="todo TODO">TODO</span> <span class="priority">[F]</span> NIST Compliance</h2>
</div>
<div id="outline-container-org0e0172b" class="outline-2">
<h2 id="org0e0172b"><span class="todo TODO">TODO</span> <span class="priority">[F]</span> Domain Controller setup/migration</h2>
<div class="outline-text-2" id="text-org0e0172b">
<p>
Learn how to configure Certificate Authorities<br />
</p>
</div>
</div>
<div id="outline-container-org6e17f44" class="outline-2">
<h2 id="org6e17f44"><span class="todo TODO">TODO</span> <span class="priority">[F]</span> Figure out AD certificates issue</h2>
<div class="outline-text-2" id="text-org6e17f44">
<p>
<a href="https://social.technet.microsoft.com/Forums/windowsserver/en-US/e150a463-7826-4151-9623-a6e655b6540e/issuing-cas-crl-checking-not-working?forum=winserversecurity">See this discussion</a><br />
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">[2020-01-06 Mon]</span></span><br />
</p>
<ul class="org-ul">
<li><b>AIA</b>: Authority Information Access<br /></li>
<li><b>CDP</b>: Certificate Distribution Point<br /></li>
<li><b>CRL</b>: Certificate Revocation List<br /></li>
</ul>

<p>
<span class="timestamp-wrapper"><span class="timestamp">[2019-12-31 Tue]</span></span><br />
Service specific error: 2148081683<br />
</p>

<p>
Tried to add the revocation checking back into the certificate services with the following:<br />
</p>

<p>
certutil –setreg ca\CRLFlags -CRLF_REVCHECK_IGNORE_OFFLINE<br />
</p>

<p>
net stop certsvc<br />
net start certsvc<br />
</p>

<p>
But I had to add it back because doing this gave me that error. Changed the minus to a plus before CRLF_REVCHECK_IGNORE_OFFLINE.<br />
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2019-01-24 Thu 00:00</p>
<p class="author">Author: Cole Turner</p>
<p class="date">Created: 2020-01-31 Fri 10:21</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
